#include<iostream>
using namespace std;
int main()
{
    /// Преговор едномерни масиви

	/// Какво наричахме едномерен масив?
    /// поредица от клетка
    /// почваме от клетка с индекс 0
    /// еднакъв тип данни във всички клетки
    /// последователни клетки

    /// Как достъпваме елементите на едномерния масив?
    /// <име_на_масива>[<индекс_на_клетка>]
    /// arr[0]

	/// Как създаваме един едномерен масив в С++?
    /// 1. Въвеждаме си размера на масива
    /// 2. Декларираме масива
    /// 3. Ако искаме да въвеждаме елементи от конзолата,
    ///     правим for цикъл, с който
    /// 1.
    int sz; /// декларираме размера
    cin>>sz; /// задаваме стойност на размера
    /// 2.
    int arr[sz]; /// <тип_данни> <име_на_масива>[<размера_на_масива>];
    /// 3.
    for(int i = 0; i < sz; i++)
    {
        cin>>arr[i];
    }

    /// Извеждаме масива на екрана
    for(int i = 0; i < sz; i++)
    {
        cout<<arr[i]<<" ";
    }

    /// Как да намерим сума/произведение на елементите на четните/нечетните елементи на масив?
    int sz;
    cin>>sz;
    int arr[sz];
    int sum = 0, prod = 1;
    for(int i = 0; i < sz; i++)
    {
        if(i % 2 == 0)
        {
            sum = sum + arr[i];
        }
        else
        {
            prod = prod * arr[i];
        }
    }
    /// или можем да направим така
    for(int i = 0; i < sz; i = i + 2)
    {
        sum = sum + arr[i];
    }
    for(int i = 1; i < sz; i = i + 2)
    {
        prod = prod * arr[i];
    }
    cout<<sum<<" "<<prod;

    /// Как можем да намерим минимален/максимален елемент в масив?
    int MIN = arr[0];
    int MAX = arr[0];
    for(int i = 0; i < sz; i++)
    {
        if(arr[i] < MIN) /// проверяваме дали текущия елемент > от текущия минимум
        {
            MIN = arr[i];
        }
        if(arr[i] > MAX) /// проверяваме дали текущия елемент < от текущия максимум
        {
            MAX = arr[i];
        }
    }

    /// Как да сортираме по големина елементите на масива?


	/// Как да изтрием елементи от масива?

    return 0;
}
