/*
Да се състави програма, чрез която предварително се въвеждат
N броя цели числа в едномерен масив
и се изчислява сумата на всички положителни числа от масива,
до срещане на първото отрицателно число. Програмата да извежда
всички положителни числа, формиращи тази сума.
Пример:
N=10
14, 43, 47,-17, 21, 32,-43, -121, -92,143
Изход: 14, 43, 47, сума 104
*/

#include<iostream>
using namespace std;
int main()
{
    int sz, sum = 0;
    cin>>sz;
    int arr[sz];
    for(int i = 0; i < sz; i++)
    {
        cin>>arr[i];
    }
    for(int i = 0; i < sz; i++)
    {
        if(arr[i] > 0)
        {
            sum = sum + arr[i];
            cout<<arr[i]<<" ";
        }
        else
        {
            break;
        }
    }
    cout<<endl;
    cout<<sum;

    return 0;
}
